{
  "currentUserId": "namwookkim",
  "users": [
    {
      "id": "namwookkim",
      "email": "nam.wook.kim@bc.edu",
      "photo": "/namProfile.png",
      "name": "Nam Wook Kim"
    },
    {
      "id": "ilovecorgis732",
      "email": "corgis@bc.edu",
      "photo": "",
      "name": "Ms. Corgi"
    }
  ],
  "followers": [
    {
      "userId": "namwookkim",
      "followerId": "ilovecorgis732"
    },
    {
      "userId": "ilovecorgis732",
      "followerId": "namwookkim"
    }
  ],
  "posts": [
    {
      "id": "post-1",
      "userId": "ilovecorgis732",
      "photo": "/teachingRJ.jpg",
      "desc": "Learning about Environmental Racism & Justice",
      "shortContent": "Learn more about what environmental racism is and how you can advocate for justice in your daily life.",
      "longContent": "As educators deepen their understanding of the impact of racial bias—including their own unconscious biases—on children, they become more powerfully equipped to shift classroom dynamics, to re-write curriculum, to redesign institutional policies and practices in support of racial justice. When we equip educators with the necessary support to build culture, practices, and policies rooted in racial justice, we become more capable of creating spaces for healing, of restoring each other’s and our children’s full humanity, of ensuring lasting, systemic change. And when we create racially just and equitable learning environments where all children are valued, respected, and safe, we create racially just and equitable communities where all people thrive. -Center for Racial Justice",
      "datetime": "2020-02-03T22:45:28Z"
    },
    {
      "id": "post-2",
      "userId": "namwookkim",
      "photo": "/SwD6SUf4.jpg",
      "desc": "Showing Up for Racial Justice (SURJ)",
      "shortContent": "How can you stand up for Racial Justice? This article talks about the SURJ foundation and how people can advocate for racial justice everyday.",
      "longContent": "SURJ is a national network of groups and individuals working to undermine white supremacy and to work for racial justice. Through community organizing, mobilizing, and education, SURJ moves white people to act as part of a multi-racial majority for justice with passion and accountability. We work to connect people across the country while supporting and collaborating with local and national racial justice organizing efforts. SURJ provides a space to build relationships, skills and political analysis to act for change.-SURJ Foundation",
      "datetime": "2020-02-03T22:45:28Z"
    },
    {
      "id": "post-3",
      "userId": "ilovecorgis732",
      "photo": "/BLMprotest.jpg",
      "desc": "BLM and its Intersection with Environmental Racism",
      "shortContent": "BLM intersect environmental justice, read this article to learn more about how the BLM movement is an important part of fixing environmental racism.",
      "longContent": "In the United States, disproportionate percentages of people of colour live in places that are polluted with toxic waste, leading to negative health effects such as cancer, asthma, degraded cardiac function and high blood pressure. Research has also highlighted that race has a stronger influence on exposure to pollutants than poverty. This means it is likely that polluters not only site their activities in low income areas, but in some cases are actively selecting locations where there are high percentages of Black people in particular. Climate change intensifies the health impacts of pollution in these communities. For example, higher air temperatures due to global warming traps air pollutants close to the ground, further reducing air quality and exacerbating existing health issues. A recent study of 32 million US births found that women exposed to high temperatures or air pollution are more likely to have premature, underweight or stillborn babies and that Black mothers are most affected. Black communities are also disproportionately located in areas that are physically vulnerable to climate hazards, such as hurricanes and flooding. Moreover, they are often afforded unequal levels of protection from the government as compared to protection provided for other groups. For example, Hurricane Katrina highlighted the legacy of unequal flood protection in New Orleans, where racially biased distribution of government funding resulted in subpar levee protection for Black neighborhoods. -climateanalytics.org",
      "datetime": "2020-02-03T22:45:28Z"
    }
  ],
  "events": [
    {
      "id": "event-1",
      "userId": "namwookkim",
      "photo": "/callForCode.png",
      "desc": "Challenging Environmental Racism",
      "content": "Join Dr. Richard Mizelle, Dr. Kimberly Jones, ...",
      "datetime": "2020-02-09T22:45:28Z"
    },
    {
      "id": "event-2",
      "userId": "ilovecorgis732",
      "photo": "/blm.jpg",
      "desc": "BLM Protest",
      "content": "Join a BLM march to show solidarity and support for the black community.",
      "datetime": "2020-02-06T22:45:28Z"
    },
    {
      "id": "event-3",
      "userId": "ilovecorgis732",
      "photo": "/landfillsKill.jpg",
      "desc": "Climate Change Talk",
      "content": "Speakers joining to talk about climate change and how climate change effects disproportionally burden the marginalized.",
      "datetime": "2020-02-03T22:45:28Z"
    }
  ],
  "userLevel": [
    {
      "id": "namwookkim",
      "level": "beginner"
    },
    {
      "id": "ilovecorgis732",
      "level": "intermediate"
    }
  ],
  "bookList": [
    {
      "id": "namwookkim",
      "title": "How to be an Antiracist",
      "img": "/anti-racist-book-cover.jpg"
    },
    {
      "id": "namwookkim",
      "title": "White Fragility",
      "img": "/white-fragility-book-cover.jpg"
    },
    {
      "id": "namwookkim",
      "title": "Words of Change: Anti-Racism",
      "img": "/words-of-change-book-cover.jpeg"
    }
  ]
}
